art_event_api/app/controllers/events_controller.rb

  def create
    @event = Event.create(event_params)
    params[:event][:media].each do |id|
      @event.media.push(Medium.find(id))
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]