art_event_api/app/models/event.rb

SELECT  "events".* FROM "events" ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "events" ("name", "description", "images", "price", "start_date", "permanent", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def self.set_art_beat_data
    data = Event.get_art_beat_data


    data.each do |event|
      result = event[1].first[1]

      result.each do |item|

        img_array = []
        item['Image'].each do |image|
          img_array.push(image['src'])

SELECT  "venues".* FROM "venues" WHERE "venues"."name" = $1 LIMIT $2  [["name", "Bernard Goldberg Fine Arts, LLC"], ["LIMIT", 1]]
---
        def self.date_test(date)
          begin
            return Date.parse(date)
          rescue ArgumentError
            return nil
          end
        end

        Event.create(
          name: item['Name'],
          description: item['Description'],
          images: img_array,
          price: item['Price'],
          start_date: self.date_test(item['DateStart']),
          end_date: self.date_test(item['DateEnd']),
          permanent: (item['PermanentEvent'] == "1"),
          latitude: item['Latitude'],
          longitude: item['Longitude'],
          venue: Venue.find_by(name: item['Venue']['Name']),
          media: media_array
        )