art_event_api/app/models/venue.rb

SELECT  "days".* FROM "days" WHERE "days"."name" = $1 LIMIT $2  [["name", "mon"], ["LIMIT", 1]]
SELECT  "venues".* FROM "venues" WHERE "venues"."name" = $1 LIMIT $2  [["name", "Bernard Goldberg Fine Arts, LLC"], ["LIMIT", 1]]
INSERT INTO "days_venues" ("day_id", "venue_id") VALUES ($1, $2)  [["day_id", 1], ["venue_id", 1]]
INSERT INTO "venues" ("name", "category", "address", "area", "opening_time", "closing_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def self.set_art_beat_data
    data = Venue.get_art_beat_data


    data.each do |event|
      result = event[1].first[1]

      result.each do |item|
        venue = item['Venue']
        days_open = []
        venue['DaysClosed'].each do |key, value|
          if value == '0'
            days_open.push(Day.find_by(name: key))
          end
        end
        if !Venue.find_by(name: venue['Name'])
          Venue.create(
            name: venue['Name'],
            category: venue['Type'],
            address: venue['Address'],
            area: venue['Area'],
            opening_time: venue['OpeningHour'],
            closing_time: venue['ClosingHour'],
            days: days_open
          )